# Логические операторы
# Это союзы, которые позволяют объединять по несколько условий. В Python есть всего три оператора: and (и), or (или) и not (не)
# Если условия с двух сторон оператора and истинны, тогда все выражение целиком считается истинным

# a = 7 > 7 and 2 > -1
# print(a)

#False

# Выражение ложно, если оба операнда с двух сторон ложные. Если хотя бы одно из них истинное, то и все выражение истинно.

# a = 7 > 7 or 2 > -1
# print(a)

#True

# Этот оператор инвертирует булевые значения выражения. True превращается в False и наоборот. В примере внизу булево значение 0 — False. Поэтому оно превращается в True.

# a = not(0)
# print(a)

#True

# a = not(1)
# print(a)

#False
